## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # google_cloudfunctions_function.my-cap-billing-function will be updated in-place
!   resource "google_cloudfunctions_function" "my-cap-billing-function" {
        id                    = "projects/terrateam-362405/locations/us-central1/functions/cap-billing-f4fa157c45218076"
        name                  = "cap-billing-f4fa157c45218076"
!       source_archive_object = "function-source.zip" -> "f8f80bcfde2696431ddd23e9073218d3"
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.my-cap-billing-archive will be created
+   resource "google_storage_bucket_object" "my-cap-billing-archive" {
+       bucket         = "cb9078f6-88df-1a37-c39e-fd1a8f2a2b23"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "f8f80bcfde2696431ddd23e9073218d3"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "./function-source.zip"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.06 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.06 | 0.06|
| | **Total** | **0.00** | **0.06** | **0.06** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
